Revit 2027 API
ExternalResourceLoadContext.GetCallingDocumentModelPath Method
 Returns a copy of the ModelPath of the document that is requesting the external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetCallingDocumentModelPath()
Public Function GetCallingDocumentModelPath As ModelPath
public:
ModelPath^ GetCallingDocumentModelPath()
member GetCallingDocumentModelPath : unit -> ModelPath
Return Value
ModelPath
 A copy of the ModelPath of the document that is requesting the external resource.
Exceptions
Exception | Condition
InvalidOperationException |  The document requesting the external resource does not have a ModelPath, either because it is detached, or because it has not been saved to disk yet.
See Also
Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace